Конфигурация/Documents/ВводКредитногоИнструмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВводКредитногоИнструмента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ПроцентыПоКредитнымИнструментам</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ВводыВыводыАктивовВВалютеУчета</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКредитныхИнструментах</xr:Item>
				<xr:Item>InformationRegister.НоминалыКредитныхИнструментов</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПроцентов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПроцентовБУ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПроцентовНУ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоходовБудущихПериодов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКорректировкиПоАмортизированнойСтоимости</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКорректировкиПоАмортизированнойСтоимостиБУ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияПриходаПроцентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПрихода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Частичный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияНоминала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ДенежныеСредстваВКредитныхИнструментах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваВКредитныхИнструментах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКредитногоИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКредитныхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКредитногоИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКредитныхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ВводыВыводыАктивовВВалютеУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ВводыВыводыАктивовВВалютеУчета</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БалансоваяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РыночнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацииВводаВыводаДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ПроцентыПоКредитнымИнструментам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПроцентыПоКредитнымИнструментам</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Частичный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccountingRegisters/ЕдиныйБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccountingRegister>
		<Properties>
			<Name>ЕдиныйБухгалтерскийУчет</Name>
			<ChartOfAccounts>ChartOfAccounts.Единый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОпераций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыКредитныхИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКредитныхИнструментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выданный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полученный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ВводКредитногоИнструмента/Ext/ObjectModule.bsl
Процедура УстановитьБлокировки()

	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;

	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах");
	
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  	ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("КредитныйИнструмент",          	ЭтотОбъект.КредитныйИнструмент);

	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.УсловияКредитныхИнструментов");
	ЭлементБлокировкиДанных.УстановитьЗначение("КредитныйИнструмент",           ЭтотОбъект.КредитныйИнструмент);

	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки()

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ДенежныеСредстваВКредитныхИнструментах.Записывать 	= Истина;
	Движения.ВводыВыводыАктивовВВалютеУчета.Записывать     	 	= Истина;
	
	ЭтоДепозитныйВклад = ТипЗнч(ЭтотОбъект.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады");
	// остатки д/с на депозите
	Движение = Движения.ДенежныеСредстваВКредитныхИнструментах.ДобавитьПриход();
	
	Движение.Период 					  = ЭтотОбъект.Дата;
	Движение.Организация 				  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.КредитныйИнструмент		  = ЭтотОбъект.КредитныйИнструмент;
	Если ЭтоДепозитныйВклад Тогда
		Движение.ВидКредитногоИнструмента	  = Перечисления.ВидыКредитныхИнструментов.Выданный;
		Движение.ТипКредитногоИнструмента	  = Перечисления.ТипыКредитныхИнструментов.ДепозитныйВклад;
	Иначе
		Движение.ТипКредитногоИнструмента	  = Перечисления.ТипыКредитныхИнструментов.Займ;
		Если ЭтотОбъект.КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Выданный Тогда
			Движение.ВидКредитногоИнструмента	  = Перечисления.ВидыКредитныхИнструментов.Выданный;
		Иначе
			Движение.ВидКредитногоИнструмента	  = Перечисления.ВидыКредитныхИнструментов.Выданный;
		КонецЕсли;		
	КонецЕсли;
	Движение.Сумма                        = ЭтотОбъект.Сумма;
	
	// вводы/выводы активов
	Движение = Движения.ВводыВыводыАктивовВВалютеУчета.Добавить();
	
	Движение.Период						  = ЭтотОбъект.Дата;
	Движение.НаправлениеДвижения		  = Перечисления.ВидыДвижений.Приход;
	Движение.Организация				  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Если ЭтоДепозитныйВклад Тогда
		Движение.ВидАктива					  = Перечисления.ВидыАктивов.ДепозитныеВклады;
	Иначе
		Если ЭтотОбъект.КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Выданный Тогда
			Движение.ВидАктива					  = Перечисления.ВидыАктивов.ДебиторскаяЗадолженность;
		Иначе
			Движение.ВидАктива					  = Перечисления.ВидыАктивов.КредиторскаяЗадолженность;
		КонецЕсли;
	КонецЕсли;
	Движение.РыночнаяСтоимость			  = ЭтотОбъект.Сумма + ЭтотОбъект.СуммаПроцентов + ЭтотОбъект.СуммаКорректировкиПоАмортизированнойСтоимости;
	Движение.БалансоваяСтоимость		  = ЭтотОбъект.Сумма + ЭтотОбъект.СуммаПроцентовБУ + ЭтотОбъект.СуммаКорректировкиПоАмортизированнойСтоимостиБУ;

	Движения.Записать();
	
	// проверим, что в результате сумма д/с на депозите соотв. сумме документа,
	// т.к. в противном случае это означает, что номинал уже был
	ДанныеКредитногоИнструмента = РаботаСКредитнымиИнструментами.ПолучитьНоминалИДатуПогашенияКредитногоИнструмента(ЭтотОбъект, Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Включая));

	Если ЭтоДепозитныйВклад И ЭтотОбъект.КредитныйИнструмент.ДоВостребования И НЕ ЗначениеЗаполнено(ДанныеКредитногоИнструмента.ДатаПогашения) Тогда
		//Для депозитов "до востребования" дата погашения не контролируется
	ИначеЕсли ДанныеКредитногоИнструмента.ДатаПогашения = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У " + ?(ЭтоДепозитныйВклад, "депозитного вклада", "займа") + " " + ЭтотОбъект.КредитныйИнструмент + " не указана дата погашения ", ЭтотОбъект, "КредитныйИнструмент",, Отказ);
	Иначе
		Если ДанныеКредитногоИнструмента.ДатаПогашения < НачалоДня(ЭтотОбъект.Дата) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата документа " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + " не может быть больше даты погашения " + Формат(ДанныеКредитногоИнструмента.ДатаПогашения, "ДФ=dd.MM.yyyy") , ЭтотОбъект, "Дата",, Отказ);
		КонецЕсли; 
	КонецЕсли;	

	Если ДанныеКредитногоИнструмента.ТекущийНоминал <> ЭтотОбъект.Сумма Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"У депозита " + ЭтотОбъект.КредитныйИнструмент + " присутствует текущий номинал.
			|Для довнесения д/с воспользуйтесь документом «Размещение кредитного инструмента»",
			ЭтотОбъект, "КредитныйИнструмент",, Отказ);
	КонецЕсли;	
	
	
	Движения.НоминалыКредитныхИнструментов.Записывать						= Истина;
	Движения.ПроцентыПоКредитнымИнструментам.Записывать	= Истина;
	
	// приход %
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПроцентыПоКредитнымИнструментам.Регистратор КАК РегистраторПриходаПроцентов,
		|	ВводКредитногоИнструментаИсторияПриходаПроцентов.ДатаПрихода КАК Период,
		|	ВводКредитногоИнструментаИсторияПриходаПроцентов.Ссылка КАК Регистратор,
		|	ВводКредитногоИнструментаИсторияПриходаПроцентов.Ссылка.КредитныйИнструмент КАК КредитныйИнструмент,
		|	ВводКредитногоИнструментаИсторияПриходаПроцентов.НачалоПериода КАК НачалоПериода,
		|	ВводКредитногоИнструментаИсторияПриходаПроцентов.ОкончаниеПериода КАК ОкончаниеПериода,
		|	ВводКредитногоИнструментаИсторияПриходаПроцентов.Частичный КАК Частичный,
		|	ВводКредитногоИнструментаИсторияПриходаПроцентов.Ссылка.Организация КАК Организация,
		|	ВводКредитногоИнструментаИсторияПриходаПроцентов.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВводКредитногоИнструментаИсторияПриходаПроцентов.Сумма КАК Сумма
		|ИЗ
		|	Документ.ВводКредитногоИнструмента.ИсторияПриходаПроцентов КАК ВводКредитногоИнструментаИсторияПриходаПроцентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентыПоКредитнымИнструментам КАК ПроцентыПоКредитнымИнструментам
		|		ПО (НАЧАЛОПЕРИОДА(ВводКредитногоИнструментаИсторияПриходаПроцентов.ДатаПрихода, ДЕНЬ) = НАЧАЛОПЕРИОДА(ПроцентыПоКредитнымИнструментам.Период, ДЕНЬ))
		|			И ВводКредитногоИнструментаИсторияПриходаПроцентов.Ссылка.КредитныйИнструмент = ПроцентыПоКредитнымИнструментам.КредитныйИнструмент
		|			И ВводКредитногоИнструментаИсторияПриходаПроцентов.Ссылка <> ПроцентыПоКредитнымИнструментам.Регистратор
		|ГДЕ
		|	ВводКредитногоИнструментаИсторияПриходаПроцентов.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.РегистраторПриходаПроцентов) Тогда
			ТекстСообщения = "Приход процентов за " + Формат(Выборка.Период, "ДФ=dd.MM.yy") + " уже введён документом: " + Выборка.РегистраторПриходаПроцентов + Символы.ПС + 
							" Повторный ввод невозможен. Отредактируйте таблицу периоды прихода процентов!";
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Прервать;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Движения.ПроцентыПоКредитнымИнструментам.Добавить(), Выборка);
			
	КонецЦикла;
	
	// История номиналов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОНЕЦПЕРИОДА(ВводКредитногоИнструментаИсторияНоминала.Период, ДЕНЬ) КАК Период,
		|	ВводКредитногоИнструментаИсторияНоминала.Ссылка КАК Регистратор,
		|	ВводКредитногоИнструментаИсторияНоминала.Ссылка.КредитныйИнструмент КАК КредитныйИнструмент,
		|	ВводКредитногоИнструментаИсторияНоминала.Сумма КАК Сумма,
		|	ВводКредитногоИнструментаИсторияНоминала.Ссылка.Организация КАК Организация,
		|	ВводКредитногоИнструментаИсторияНоминала.Примечание КАК Примечание
		|ИЗ
		|	Документ.ВводКредитногоИнструмента.ИсторияНоминала КАК ВводКредитногоИнструментаИсторияНоминала
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыКредитныхИнструментов КАК НоминалыКредитныхИнструментов
		|		ПО ВводКредитногоИнструментаИсторияНоминала.Ссылка.КредитныйИнструмент = НоминалыКредитныхИнструментов.КредитныйИнструмент
		|			И (КОНЕЦПЕРИОДА(ВводКредитногоИнструментаИсторияНоминала.Период, ДЕНЬ) = КОНЕЦПЕРИОДА(НоминалыКредитныхИнструментов.Период, ДЕНЬ))
		|			И ВводКредитногоИнструментаИсторияНоминала.Ссылка <> НоминалыКредитныхИнструментов.Регистратор
		|ГДЕ
		|	ВводКредитногоИнструментаИсторияНоминала.Ссылка = &Ссылка
		|	И НоминалыКредитныхИнструментов.Сумма ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Движения.НоминалыКредитныхИнструментов.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт

	Если ТипЗнч(ЭтотОбъект.КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано проведение по ЕПС закрытия займа", ЭтотОбъект.Ссылка,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	УчетныйАктив = Справочники.ДепозитныеВклады.ОпределитьУчетныйАктивДепозита(ЭтотОбъект.КредитныйИнструмент, ЭтотОбъект.Дата);
	// *************** ТЕЛО ******************
	СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.Сумма, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Ввод депозитного вклада");
	
	Проводка.СчетДт = УчетныйАктив.СчетУчета;
		
	Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет;
	Проводка.СубконтоДт.ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
	
	Проводка.ВалютаДт  = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
	Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
	
	Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
	Проводка.СубконтоКт.Договоры = СчетДоверительногоУправления;
	
	// *************** % ******************
	СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.СуммаПроцентовБУ, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Ввод депозитного вклада");
	
	Проводка.СчетДт = УчетныйАктив.СчетУчетаПереоценкиА;
		
	Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Банк.ЮрФизЛицо;
	Проводка.СубконтоДт.УсловияЗаймовКредитовИДепозитов = ЭтотОбъект.КредитныйИнструмент;
	
	Проводка.ВалютаДт  = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
	Проводка.ВалютнаяСуммаДт = ЭтотОбъект.СуммаПроцентовБУ;
	
	Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
	ПРоводка.СубконтоКт.Договоры = СчетДоверительногоУправления;
	
	// *************** корректировка ЭСП ******************
	Если ЭтотОбъект.СуммаКорректировкиПоАмортизированнойСтоимостиБУ > 0 Тогда
		
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.СуммаКорректировкиПоАмортизированнойСтоимостиБУ, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Ввод депозитного вклада");
		
		Проводка.СчетДт = УчетныйАктив.СчетУчетаКорректировокА;
			
		Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет;
		Проводка.СубконтоДт.ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
		
		Проводка.ВалютаДт  = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
		Проводка.ВалютнаяСуммаДт = ЭтотОбъект.СуммаКорректировкиПоАмортизированнойСтоимостиБУ;
		
		Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
		ПРоводка.СубконтоКт.Договоры = СчетДоверительногоУправления;
		
	ИначеЕсли ЭтотОбъект.СуммаКорректировкиПоАмортизированнойСтоимостиБУ < 0 Тогда
		
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(-ЭтотОбъект.СуммаКорректировкиПоАмортизированнойСтоимостиБУ, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Ввод депозитного вклада");
		
		Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
		ПРоводка.СубконтоДт.Договоры = СчетДоверительногоУправления;
		
		Проводка.СчетКт = УчетныйАктив.СчетУчетаКорректировокП;
			
		Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет;
		Проводка.СубконтоКт.ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
		
		Проводка.ВалютаКт  = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
		Проводка.ВалютнаяСуммаКт = -ЭтотОбъект.СуммаКорректировкиПоАмортизированнойСтоимостиБУ;
		
	КонецЕсли;
	
	Если ЭтотОбъект.СуммаДоходовБудущихПериодов Тогда
		//для депозита с выплатой процентов авансом:
			
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.СуммаДоходовБудущихПериодов, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Ввод депозитного вклада");
		
		Проводка.СчетДт = ПланыСчетов.Единый.АктивыВДУ03;
		ПРоводка.СубконтоДт.Договоры = СчетДоверительногоУправления;
		
		Проводка.СчетКт = ПланыСчетов.Единый.Депозиты13;
		Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет;
		Проводка.СубконтоКт.УсловияЗаймовКредитовИДепозитов = ЭтотОбъект.КредитныйИнструмент;
		Проводка.ВалютаКт  = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
		Проводка.ВалютнаяСуммаКт = ЭтотОбъект.СуммаДоходовБудущихПериодов;
		
	КонецЕсли;
		
КонецПроцедуры
 
Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	Если ТипЗнч(ЭтотОбъект.КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано проведение по бухучету закрытия займа", ЭтотОбъект.Ссылка,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	УчетныйРегистр = Движения[УчетныйРегистр].Метаданные().Имя;
	
	СчетРасчетов = БухгалтерскийУчет.ОпределитьСчетРасчетовПоДоговоруДоверительногоУправления(
			ЭтотОбъект.Дата, 
			ЭтотОбъект.Организация, 
			ЭтотОбъект.СчетДоверительногоУправления, 
			Неопределено);
			
	ЕстьСубконтоКонтрагенты = (СчетРасчетов.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);
	
	Если ЕстьСубконтоКонтрагенты Тогда
		КонтрагентДляПроводок = РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицоСчетаДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата);
	КонецЕсли;
			
	Если ЭтотОбъект.Сумма <> 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ЭтотОбъект.Сумма, "Ввод депозитного вклада");
		
		// Дебет
		Проводка.СчетДт = БухгалтерскийУчет.ОпределитьСчетУчетаАктивов(
			ЭтотОбъект.Дата,
			ЭтотОбъект.Организация,
			ЭтотОбъект.СчетДоверительногоУправления,
			Справочники.УчетныеАктивы.ДепозитныеВклады,
			УчетныйРегистр);
			
		Проводка.СубконтоДт.ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
		
		// Кредит
		Проводка.СчетКт = СчетРасчетов;
			
		Если ЕстьСубконтоКонтрагенты Тогда
			Проводка.СубконтоКт.Контрагенты = КонтрагентДляПроводок;
		КонецЕсли;
			
	КонецЕсли;
	
	
	Если (УчетныйРегистр = "НалоговыйУчет" И ЭтотОбъект.СуммаПроцентовНУ <> 0)
		ИЛИ (УчетныйРегистр = "БухгалтерскийУчет" И ЭтотОбъект.СуммаПроцентовБУ <> 0) Тогда
	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр],?(УчетныйРегистр = "НалоговыйУчет", ЭтотОбъект.СуммаПроцентовНУ,  ЭтотОбъект.СуммаПроцентовБУ), "Ввод процентов по депозитному вкладу");
		
		// Дебет
		Проводка.СчетДт = БухгалтерскийУчет.ОпределитьСчетУчетаПереоценкиАктивов(
			ЭтотОбъект.Дата,
			ЭтотОбъект.Организация,
			ЭтотОбъект.СчетДоверительногоУправления,
			Справочники.УчетныеАктивы.ДепозитныеВклады,
			УчетныйРегистр);
			
		Проводка.СубконтоДт.ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
		
		// Кредит
		Проводка.СчетКт = СчетРасчетов;
			
		Если ЕстьСубконтоКонтрагенты Тогда
			Проводка.СубконтоКт.Контрагенты = КонтрагентДляПроводок;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "КредитныйИнструмент, Сумма, СуммаПроцентов, СуммаПроцентовБУ, СуммаПроцентовНУ, СуммаКорректировкиПоАмортизированнойСтоимости, СуммаКорректировкиПоАмортизированнойСтоимостиБУ, СуммаДоходовБудущихПериодов");
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	Если ЭтотОбъект.Дата >= РаботаСДокументами.ДатаНачалаПроверкиЗаполненияКонтрагента() Тогда
		ПроверяемыеРеквизиты.Добавить("Контрагент");
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		Если ЗначениеЗаполнено(ЭтотОбъект.СуммаПроцентов) и ЗначениеЗаполнено(ЭтотОбъект.СуммаДоходовБудущихПериодов) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не должны быть одновременно заполнены суммы начисленных процентов и доходов будущих периодов", ЭтотОбъект, "СуммаДоходовБудущихПериодов",, Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.Контрагент) И ЭтотОбъект.Дата >= РаботаСДокументами.ДатаНачалаПроверкиЗаполненияКонтрагента() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено значение реквизита [Контрагент]!", ЭтотОбъект, "Контрагент",, Отказ);
		КонецЕсли;
		
		//Если депозит перевели из одного счета ДУ в другой счет ДУ, необходимо изменить условия, в частности "расчетный счет возврата дс".
		//Проверим - были ли изменены условия.
		РасчетныйСчетВозвратаДС = РаботаСКредитнымиИнструментами.ПолучитьРасчетныйСчетВозвратаДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.КредитныйИнструмент);
		
		Если ЗначениеЗаполнено(РасчетныйСчетВозвратаДС) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет КАК РасчетныйСчет
				|ИЗ
				|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
				|ГДЕ
				|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
				|	И ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = &СчетДоверительногоУправления
				|	И ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет = &РасчетныйСчетВозвратаДС
				|	И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
				|			ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия > &Дата)";
			
			Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
			Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
			Запрос.УстановитьПараметр("РасчетныйСчетВозвратаДС", РасчетныйСчетВозвратаДС);
			Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
			
			Если Запрос.Выполнить().Пустой() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В условиях кредитного инструмента указан расчетный счет [" + РасчетныйСчетВозвратаДС + "], которого нет в исполнителях (собственных) для счета ДУ [" + ЭтотОбъект.СчетДоверительногоУправления + "]!", ЭтотОбъект, "КредитныйИнструмент", "Объект", Отказ);	
			КонецЕсли;
					
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
